{
  "heroName": "Fredy Santamaria",
  "heroTitle": "Ingeniero de Software | Análisis de Datos",
  "heroEducation": "M.S. Análisis de Datos (En Curso) • B.S. Ciencias de la Computación • A.S. Ciberseguridad",
  "heroTagline": "Construyendo soluciones eficientes y escalables que generan un impacto empresarial medible. Apasionado por la automatización, insights basados en datos y el aprendizaje continuo.",
  "journeyTitle": "Mi Camino",
  "journey": [
    {
      "date": "Enero 2020 - Septiembre 2020",
      "title": "Embajador Estudiantil y Asistente de Laboratorio | Ivy Tech",
      "desc": "Proporcioné soporte técnico a estudiantes con problemas de software, hardware y red. Interactué con estudiantes potenciales sobre programas y eventos universitarios."
    },
    {
      "date": "Abril 2020 - Abril 2022",
      "title": "Técnico de Soporte de TI | Berry It",
      "desc": "Instalé y optimicé sistemas de bases de datos MySQL y MS SQL. Lideré proyectos internos incluyendo migraciones, desarrollo de software y actualizaciones de hardware. Reduje el tiempo de inactividad del sistema mediante soporte técnico proactivo."
    },
    {
      "date": "Abril 2022 - Presente",
      "title": "Ingeniero de Software | Berry It",
      "desc": "Especialista en desarrollo full-stack y automatización. Construyendo aplicaciones de grado de producción que resuelven problemas empresariales reales y entregan resultados medibles."
    }
  ],
  "impactTitle": "Logros Clave",
  "impact": [
    "Construí API geoespacial integrando datos de Vetro para automatizar enrutamiento de tickets 811 — ahorré ~30 horas/semana",
    "Lideré desarrollo full-stack de aplicación de seguimiento de tiempo (C#, Flask, MS SQL) — ahorré ~20 horas/semana en administración",
    "Automaticé recordatorios de ajuste de tiempo vía ADP API y SlickText API — ahorré a RRHH ~5 horas/semana",
    "Desarrollé y mantuve diversas aplicaciones de producción usando Python, JavaScript, C#, Flask, SQL, Redis asegurando escalabilidad y confiabilidad"
  ],
  "educationTitle": "Educación",
  "education": [
    {
      "school": "Western Governors University",
      "degree": "M.S. Análisis de Datos",
      "status": "Esperado Abril 2026"
    },
    {
      "school": "Western Governors University",
      "degree": "B.S. Ciencias de la Computación",
      "status": "Completado"
    },
    {
      "school": "Ivy Tech Community College",
      "degree": "A.S. Ciberseguridad",
      "status": "Completado"
    },
    {
      "school": "Ivy Tech Community College",
      "degree": "A.S. Artes Liberales",
      "status": "Completado"
    }
  ],
  "skillsTitle": "Habilidades Técnicas",
  "skills": {
    "advanced": [
      "Python",
      "Flask",
      "Django",
      "SQL (MySQL, PostgreSQL, MS SQL)",
      "Git",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "proficient": [
      "Docker",
      "REST APIs",
      "Redis",
      "C#",
      "OOP",
      "CI/CD",
      "Agile",
      "Nginx",
      "jQuery",
      "ETL"
    ],
    "learning": [
      "React",
      "Next.js",
      "Node.js",
      "Express.js",
      "Machine Learning",
      "PyTorch",
      "Scikit-Learn",
      "TensorFlow",
      "Apache Airflow",
      "Azure (AZ-204)"
    ]
  },
  "learningTitle": "Enfoque de Aprendizaje",
  "learning": "Creo en <strong>Leer, Comparar y Observar</strong>. Me sumerjo en la documentación, conecto nuevos conceptos con conocimientos existentes como resolviendo un rompecabezas, y mejoro mi comprensión viendo cómo desarrolladores experimentados usan herramientas y tecnologías. Este enfoque multifacético me ayuda no solo a aprender sintaxis, sino a entender el 'por qué' detrás de las decisiones técnicas.",
  "goalsTitle": "Enfoque Actual",
  "goalsIntro": "Como Ingeniero de Software que cursa una Maestría en Análisis de Datos, me enfoco en la intersección de la ingeniería de software y la ciencia de datos:",
  "goals": [
    "Dominar herramientas de visualización y análisis de datos (Tableau, BigQuery, R)",
    "Profundizar experiencia en machine learning con PyTorch y TensorFlow",
    "Construir aplicaciones full-stack con React y Next.js",
    "Preparándome para certificación Azure Developer Associate (AZ-204)",
    "Contribuir a proyectos de código abierto en ingeniería de datos"
  ]
}
