{
  "heroName": "Fredy Santamaria",
  "heroTitle": "Ingeniero de Software",
  "heroTagline": "Apasionado por aprender, programar y hacer pan. Construyendo soluciones eficientes que marcan la diferencia.",
  "journeyTitle": "Mi Camino",
  "journey": [
      { "date": "Abril 2020", "title": "Inicio en Tecnología", "desc": "Comencé como Técnico de Soporte de TI en Kokomo, Indiana, adquiriendo experiencia práctica con tecnología y operaciones empresariales." },
      { "date": "Abril 2022", "title": "Promoción a Ingeniero de Software", "desc": "Avancé al rol de Ingeniero de Software, enfocándome en automatización, desarrollo de aplicaciones y optimización de procesos." },
      { "date": "Presente", "title": "Creciendo y Aprendiendo", "desc": "Expandiendo continuamente habilidades en tecnologías web modernas, análisis de datos y machine learning mientras contribuyo a proyectos impactantes." }
  ],
  "experienceTitle": "Experiencia",
  "experience": {
      "company": "Ingeniero de Software en BerryIt, Inc.",
      "highlights": [
          "Automaticé procesos empresariales críticos con Python, reduciendo el tiempo de ejecución en 25%",
          "Construí aplicaciones escalables usando Python, JavaScript, C#, Flask, SQL y Docker",
          "Lideré el desarrollo de aplicación de seguimiento de tiempo, escalando de 5 a más de 60 usuarios concurrentes",
          "Mejoré tiempos de respuesta de 10 segundos a menos de 2 segundos mediante optimización"
      ]
  },
  "skillsTitle": "Habilidades",
  "skills": [
      { "name": "Python", "category": "Experto" },
      { "name": "Flask/Django", "category": "Experto" },
      { "name": "JavaScript", "category": "Competente" },
      { "name": "SQL", "category": "Competente" },
      { "name": "Docker", "category": "Competente" },
      { "name": "Git", "category": "Competente" },
      { "name": "React", "category": "Aprendiendo" },
      { "name": "ML/AI", "category": "Aprendiendo" }
  ],
  "learningTitle": "Enfoque de Aprendizaje",
  "learning": "Creo en aprender a través de lectura, comparación y observación. Me sumerjo en la documentación, comparo conceptos nuevos con conocimientos existentes como resolviendo un rompecabezas, y mejoro mi comprensión viendo cómo otros usan herramientas y tecnologías.",
  "goalsTitle": "Enfoque Actual",
  "goalsIntro": "Como Ingeniero de Software, reconozco las infinitas oportunidades de crecimiento. Actualmente enfocándome en:",
  "goals": [
      "Visualización y Análisis de Datos",
      "Explorar Machine Learning",
      "Mejorar Habilidades de Diseño UI/UX",
      "Contribuir a Código Abierto"
  ]
}